let parks = [
{
        name: 'Парк Шевченка',
        description: 'Один з найвідоміших парків у центрі Києва, заснований у 1869 році навпроти червоного корпусу університету. Має багато зелених насаджень та затишних алей.',
        coordinates: [50.4414, 30.5126],
        area: 5.4
    },
    {
        name: 'Маріїнський парк',
        description: 'Старовинний парк уздовж Дніпровських схилів, відомий своїми фонтанами, оглядовими майданчиками та історичною атмосферою.',
        coordinates: [50.4475, 30.5375],
        area: 8.9
    },
    {
        name: 'Голосіївський парк',
        description: 'Величезний природний парк із каскадом озер, густими лісовими масивами та просторими зонами для прогулянок і відпочинку.',
        coordinates: [50.3861, 30.5015],
        area: 140.9
    },
    {
        name: 'Парк «Феофанія»',
        description: 'Пам\'ятка садово-паркового мистецтва з мальовничими озерами, доглянутими газонами, цілющими джерелами та паломницькими стежками.',
        coordinates: [50.3395, 30.4851],
        area: 152.0
    },
    {
        name: 'Парк «Кіото»',
        description: 'Затишний парк у японському стилі, який славиться найдовшою в Україні алеєю сакур, пагодою та штучним садом каменів.',
        coordinates: [50.4635, 30.6402],
        area: 13.0
    },
    {
        name: 'Сквер на Контрактовій площі',
        description: 'Невеликий, але живий зелений острівець у серці історичного Подолу, популярне місце зустрічей для студентів та містян.',
        coordinates: [50.4646, 30.5183],
        area: 1.5
    },
    {
        name: 'Парк «Наталка»',
        description: 'Сучасний та облаштований парк на Оболонській набережній із чудовим краєвидом на річку Дніпро та розвиненими спортивними зонами.',
        coordinates: [50.4965, 30.5229],
        area: 12.0
    }
]

var map = L.map('map').setView([50.4501, 30.5234], 12);

L.tileLayer('https://tile.openstreetmap.org/{z}/{x}/{y}.png', {
    attribution: '&copy; <a href="https://www.openstreetmap.org/copyright">OpenStreetMap</a> contributors'
}).addTo(map);

const icon = L.divIcon({
    html: '🌳',
    className: 'icon',
    iconSize: [30, 30],
    iconAnchor: [15, 30]
});

parks.forEach(park => { 
    L.marker(park.coordinates, { icon: icon }).addTo(map)
    .bindPopup(`<b>${park.name}</b><br>${park.description}<br>Площа: ${park.area} га.`).openPopup();
});

